	IDENTIFICATION DIVISION.
	PROGRAM-ID. FIZZBUZZ.

	DATA DIVISION.
		WORKING-STORAGE SECTION.
			01 WS-count PIC 9(2) VALUE 0.
			01 WS-fizzOut PIC 9(2).
			01 WS-fizzIn PIC 9(2).
			01 WS-buzzOut PIC 9(2).
			01 WS-buzzIn PIC 9(2).
			01 WS-runs PIC 9(2).

	PROCEDURE DIVISION.
		Main.
			ACCEPT WS-runs.
			DISPLAY "Begin FizzBuzz execution.".
			PERFORM ToFizzBuzz UNTIL WS-count > WS-runs
			STOP RUN.

		ToFizzBuzz.
			DIVIDE WS-count BY 3 GIVING WS-fizzIn REMAINDER WS-fizzOut.
			IF WS-fizzOut = 0 AND WS-count NOT = 0
				DIVIDE WS-count BY 5 GIVING WS-buzzIn REMAINDER WS-buzzOut
				IF WS-buzzOut = 0 AND WS-count NOT = 0
					DISPLAY "FizzBuzz"
				ELSE
					DISPLAY "FIZZ"
				END-IF
			END-IF.



			DIVIDE WS-count BY 5 GIVING WS-buzzIn REMAINDER WS-buzzOut.
			IF WS-buzzOut = 0 AND WS-count NOT = 0 AND WS-fizzOut NOT = 0
				DISPLAY "BUZZ"
			END-IF.

			IF WS-fizzOut NOT = 0 AND WS-buzzOut NOT = 0
				DISPLAY " " WS-count
			END-IF.

			ADD 1 TO WS-count.
